# 加载库

In [3]:
from common import *

# 1、布尔类型转int类型(astype函数)

In [6]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li','San Zhang','San Zhang'], 'Age':[20,30,10,15]})
df2 = pd.DataFrame({'Name':['Si Li','Wu Wang','San Zhang'], 'Gender':['F','M','Y']})
df = df1.merge(df2, on='Name', how='left')
df

        Name  Age Gender
0  San Zhang   20      Y
1      Si Li   30      F
2  San Zhang   10      Y
3  San Zhang   15      Y

In [7]:
df['compare'] = (df['Name'] == df['Gender'])
df['compare'] = df['compare'].astype(int)
df

        Name  Age Gender  compare
0  San Zhang   20      Y        0
1      Si Li   30      F        0
2  San Zhang   10      Y        0
3  San Zhang   15      Y        0

# 2、DataFrame增加一行数据

In [8]:
# 这种方法在高版本会有警告：FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
data = pd.DataFrame(columns=['x', 'y'])
a = {'x':1, 'y':2}
data = data.append(a,ignore_index=True)
print(data)

   x  y
0  1  2

In [9]:
b = {'x':11, 'y':22}
data = pd.concat([data, pd.DataFrame([b])], ignore_index=True)
data

    x   y
0   1   2
1  11  22

# 3、字典转DataFrame

In [12]:
fruit_dict = {
    3: 'apple',
    2: 'banana',
    6:'mango',
    4:'apricot',
    1:'kiwi',
    8:'orange'}

#pd.DataFrame(fruit_dict)
pd.DataFrame(list(fruit_dict.items()),
                   columns=['Quantity', 'FruitName'])

   Quantity FruitName
0         3     apple
1         2    banana
2         6     mango
3         4   apricot
4         1      kiwi
5         8    orange

In [13]:
pd.DataFrame([fruit_dict])

       3       2      6        4     1       8
0  apple  banana  mango  apricot  kiwi  orange